       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITMETICA.
      *******************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = GABRIELLE NUNES
      *OBJETIVO: OPERAÇÕES ARITMÉTICAS
      *DATA = 25/08/2021
      *******************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NUM1  PIC 9(02) VALUE ZEROS.
       77 WRK-NUM2  PIC 9(02) VALUE ZEROS.
       77 WRK-RESUL PIC 9(03) VALUE ZEROS.
       77 WRK-RESTO PIC 9(02) VALUE ZEROS.
       77 WRK-MASK  PIC ZZZ VALUE ZEROS.
       77 WRK-MASK-RESTO  PIC Z VALUE ZEROS.
       PROCEDURE DIVISION.
           ACCEPT WRK-NUM1 FROM CONSOLE.
           ACCEPT WRK-NUM2 FROM CONSOLE.
           DISPLAY '==========================='.
           DISPLAY 'PRIMEIRO NUMERO: ' WRK-NUM1.
           DISPLAY 'SEGUNDO NUMERO: ' WRK-NUM2.

      ******SOMA*******
           ADD WRK-NUM1 WRK-NUM2 TO WRK-RESUL.
           MOVE WRK-RESUL TO WRK-MASK.
            DISPLAY 'SOMA: ' WRK-MASK.

      ******SUBTRACAO*******
           SUBTRACT WRK-NUM1 FROM WRK-NUM2 GIVING WRK-RESUL.
           MOVE WRK-RESUL TO WRK-MASK.
           DISPLAY 'SUBTRACAO: ' WRK-MASK.

      ******DIVISAO*******
           DIVIDE WRK-NUM1 BY WRK-NUM2 GIVING WRK-RESUL
             REMAINDER WRK-RESTO.
           MOVE WRK-RESUL TO WRK-MASK.
           MOVE WRK-RESTO TO WRK-MASK-RESTO.
           DISPLAY 'DIVISAO: ' WRK-MASK.
           DISPLAY 'RESTO: ' WRK-MASK-RESTO.

      ******MULTIPLICACAO*******
           MULTIPLY WRK-NUM1 BY WRK-NUM2 GIVING WRK-RESUL.
           MOVE WRK-RESUL TO WRK-MASK.
           DISPLAY 'MULTIPLICACAO: ' WRK-MASK.

      ******COMPUTE (EXPRESSÃO)*******
           COMPUTE WRK-RESUL = (WRK-NUM1 + WRK-NUM2) / 2.
           MOVE WRK-RESUL TO WRK-MASK.
           DISPLAY 'MEDIA: ' WRK-MASK.
             STOP RUN.
