       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARRAYS2.
      *******************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = GABRIELLE NUNES
      *OBJETIVO: IMPRIMIR UMA DATA DO SISTEMA
      *UTILIZAR VARIAVEIS TIPO TABELA (ARRAY) E REDEFINIR (REDEFINES)
      *DATA = 26/08/2021
      *******************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.

       01 WRK-MESES-EXTENSO.
           02 FILLER PIC X(03) VALUE 'JAN'.
           02 FILLER PIC X(03) VALUE 'FEV'.
           02 FILLER PIC X(03) VALUE 'MAR'.
           02 FILLER PIC X(03) VALUE 'ABR'.
           02 FILLER PIC X(03) VALUE 'MAI'.
           02 FILLER PIC X(03) VALUE 'JUN'.
           02 FILLER PIC X(03) VALUE 'JUL'.
           02 FILLER PIC X(03) VALUE 'AGO'.
           02 FILLER PIC X(03) VALUE 'SET'.
           02 FILLER PIC X(03) VALUE 'OUT'.
           02 FILLER PIC X(03) VALUE 'NOV'.
           02 FILLER PIC X(03) VALUE 'DEZ'.

       01 WRK-MESES REDEFINES WRK-MESES-EXTENSO.
           02 WRK-MES PIC X(3) OCCURS 12 TIMES.

       01 WRK-DATASISTEMA.
           02 WRK-ANOSISTEMA PIC 9(04) VALUE ZEROS.
           02 WRK-MESSISTEMA PIC 9(02) VALUE ZEROS.
           02 WRK-DIASISTEMA PIC 9(02) VALUE ZEROS.

       PROCEDURE DIVISION.
           ACCEPT WRK-DATASISTEMA FROM DATE YYYYMMDD.
           DISPLAY 'DATA: ' WRK-DIASISTEMA ' DE '
           WRK-MES (WRK-MESSISTEMA) ' DE ' WRK-ANOSISTEMA.

           STOP RUN.
