       IDENTIFICATION DIVISION.
       PROGRAM-ID. AUMENTO-SALARIAL.
      *******************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = GABRIELLE NUNES
      *OBJETIVO: RECEBER NOME, ANO DE CONTRATACAO E SALARIO
      *CALCULAR AUMENTO
      *DATA = 25/08/2021
      *******************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOME       PIC X(40)       VALUE SPACES.
       77 WRK-ANOENTRADA PIC 9(04)       VALUE ZEROS.
       77 WRK-TEMPOCASA  PIC 9(02)       VALUE ZEROS.
       77 WRK-SALARIO    PIC 9(06)V99    VALUE ZEROS.
       77 WRK-AUMENTO    PIC 9(06)V99    VALUE ZEROS.
       77 WRK-AUMENTO-ED PIC $ZZZ.ZZ9,99 VALUE ZEROS.
       01 WRK-DATASISTEMA.
           02 WRK-ANO PIC 9(04) VALUE ZEROS.
           02 WRK-MES PIC 9(02) VALUE ZEROS.
           02 WRK-DIA PIC 9(02) VALUE ZEROS.

       PROCEDURE DIVISION.
           DISPLAY 'NOME DO FUNCIONARIO: '
           ACCEPT WRK-NOME.

           DISPLAY 'INFORME O ANO DE CONTRATACAO '
           ACCEPT WRK-ANOENTRADA.

           DISPLAY 'SALARIO ATUAL DO FUNCIONARIO: '
           ACCEPT WRK-SALARIO.

           ACCEPT WRK-DATASISTEMA FROM DATE YYYYMMDD.

           COMPUTE WRK-TEMPOCASA = WRK-ANO - WRK-ANOENTRADA.

           EVALUATE WRK-TEMPOCASA
              WHEN 0 THRU 1
                   COMPUTE WRK-AUMENTO = 0
              WHEN 2 THRU 5
                   COMPUTE WRK-AUMENTO = WRK-SALARIO * 0,05
              WHEN 6 THRU 15
                   COMPUTE WRK-AUMENTO = WRK-SALARIO * 0,10
              WHEN OTHER
                   COMPUTE WRK-AUMENTO = WRK-SALARIO * 0,15
           END-EVALUATE.
               MOVE WRK-AUMENTO TO WRK-AUMENTO-ED.
               DISPLAY 'AUMENTO SALARIO DE  ' WRK-AUMENTO-ED.
           STOP RUN.
