       77 WRK-VENDAS   PIC 9(6)V99  VALUE ZEROS.
       77 WRK-QTVENDAS PIC 9(03)    VALUE 0.
       77 WRK-TOTAL     PIC 9(08)V99 VALUE ZEROS.
       77 WRK-TOTAL-ED     PIC $ZZZ.ZZ9,99.
