       IDENTIFICATION DIVISION.
       PROGRAM-ID. CAIXA.
      *************************
      *EEEE
      *EEEE
      *************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-NOTA-50 PIC 9(05) VALUE ZEROS.
       77 WRK-NOTA-10 PIC 9(05) VALUE ZEROS.
       77 WRK-NOTA-5 PIC 9(05) VALUE ZEROS.
       77 WRK-NOTA-1 PIC 9(05) VALUE ZEROS.
       77 WRK-SAQUE PIC 9(08) VALUE ZEROS.
       77 WRK-SAQUE-ED PIC $ZZZ.ZZ9,99 VALUE ZEROS.

       PROCEDURE DIVISION.
       PERFORM 0100-INICIALIZAR.
       IF WRK-SAQUE > 0
           PERFORM 0200-PROCESSAR UNTIL WRK-SAQUE = 0
           ELSE
               DISPLAY 'DIGITE UM VALOR MAIOR QUE ZERO.'
               STOP RUN
       END-IF.
           PERFORM 0300-FINALIZAR.

       0100-INICIALIZAR.
           DISPLAY 'DIGITE O VALOR DO SAQUE:  '.
           ACCEPT WRK-SAQUE.

       0200-PROCESSAR.

           EVALUATE WRK-SAQUE

           WHEN >= 50
           SUBTRACT 50 FROM WRK-SAQUE
           ADD 1 TO WRK-NOTA-50

           WHEN >= 10
           SUBTRACT 10 FROM WRK-SAQUE
           ADD 1 TO WRK-NOTA-10

           WHEN >= 5
           SUBTRACT 5 FROM WRK-SAQUE
           ADD 1 TO WRK-NOTA-5

           WHEN >= 1
           SUBTRACT 1 FROM WRK-SAQUE
           ADD 1 TO WRK-NOTA-1
           END-EVALUATE.

       0300-FINALIZAR.

           DISPLAY 'NOTAS DE 50: ' WRK-NOTA-50 .
           DISPLAY 'NOTAS DE 10: ' WRK-NOTA-10 .
           DISPLAY 'NOTAS DE 5: ' WRK-NOTA-5 .
           DISPLAY 'NOTAS DE 1: ' WRK-NOTA-1 .
           STOP RUN.
