       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
      *******************************
      *AREA DE COMENTARIOS - REMARKS
      *AUTHOR = GABRIELLE NUNES
      *OBJETIVO: MOSTRAR A STRING HELLO WORLD
      *DATA = 23/08/2021
      *******************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           DISPLAY'HELLO WORLD'.
           STOP RUN.
